OdGUID.toString(OdGUID.StringFormat.Enum!System.Runtime.CompilerServices.IsConst)
\details
Returns string representation for this OdGUID.
\param format [in]  A single format specifier that indicates how to format the value of this OdGUID.
Default value is OdGUID::StringFormat::Hyphenses.
\remarks
The following table shows the accepted format specifiers for the format parameter.
"0" represents a digit; hyphens ("-"), braces ("{", "}"), and parentheses ("(", ")") appear as shown.
OdGUID::StringFormat::Digits:      00000000000000000000000000000000
OdGUID::StringFormat::Hyphenses:   00000000-0000-0000-0000-000000000000
OdGUID::StringFormat::Braces:      {00000000-0000-0000-0000-000000000000}
OdGUID::StringFormat::Parentheses: (00000000-0000-0000-0000-000000000000)
OdGUID::StringFormat::Extended:    {0x00000000,0x0000,0x0000,{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}}

OdGUID.op_Assign(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] String representation of the GUID to be assigned.

OdGUID.op_Assign(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] Other GUID object to be assigned.

OdGUID.#ctor(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of a OdGUID object with copied data from other object.
\param other [in] Object to copy from.